pressure_tests_results/with_redis_random_files_5.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 341 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 777 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1219 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1640 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2087 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2535 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2972 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3419 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3830 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4277 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4713 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5161 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5609 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 6043 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6489 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6911 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7353 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7804 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8197 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8658 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8713 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 91 MB/s
     data_sent......................: 1.1 MB 55 kB/s
     http_req_blocked...............: avg=12.25µs  min=0s       med=1µs      max=2.75ms   p(90)=2µs      p(95)=3µs     
     http_req_connecting............: avg=7.57µs   min=0s       med=0s       max=1.5ms    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=14.69ms  min=219µs    med=10.97ms  max=121.19ms p(90)=29.23ms  p(95)=37.3ms  
       { expected_response:true }...: avg=14.91ms  min=219µs    med=11.23ms  max=121.19ms p(90)=29.45ms  p(95)=37.57ms 
     http_req_failed................: 11.98% ✓ 1044       ✗ 7669
     http_req_receiving.............: avg=179.32µs min=5µs      med=32µs     max=60.18ms  p(90)=126µs    p(95)=166.39µs
     http_req_sending...............: avg=6.79µs   min=2µs      med=4µs      max=4.56ms   p(90)=9µs      p(95)=13µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=14.5ms   min=201µs    med=10.9ms   max=116.77ms p(90)=28.98ms  p(95)=37.05ms 
     http_reqs......................: 8713   433.054703/s
     iteration_duration.............: avg=115.07ms min=100.25ms med=111.29ms max=225.19ms p(90)=129.66ms p(95)=138.68ms
     iterations.....................: 8713   433.054703/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50