pressure_tests_results/wo_redis_random_files_2.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 353 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 781 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1213 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1641 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2078 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2528 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2975 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3411 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3839 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4287 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4730 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5173 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5603 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 6043 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6481 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6923 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7378 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7818 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8254 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8707 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8757 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 92 MB/s
     data_sent......................: 1.1 MB 56 kB/s
     http_req_blocked...............: avg=10.03µs  min=0s       med=1µs      max=2.73ms   p(90)=2µs     p(95)=3µs     
     http_req_connecting............: avg=6.51µs   min=0s       med=0s       max=1.34ms   p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=14.16ms  min=162µs    med=11.67ms  max=118.09ms p(90)=28.45ms p(95)=34.77ms 
       { expected_response:true }...: avg=14.46ms  min=162µs    med=11.93ms  max=118.09ms p(90)=28.77ms p(95)=34.92ms 
     http_req_failed................: 12.31% ✓ 1078       ✗ 7679
     http_req_receiving.............: avg=211.43µs min=6µs      med=35µs     max=103.92ms p(90)=124µs   p(95)=157µs   
     http_req_sending...............: avg=5.79µs   min=2µs      med=4µs      max=1.48ms   p(90)=8µs     p(95)=12µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=13.94ms  min=148µs    med=11.58ms  max=113.92ms p(90)=28.34ms p(95)=34.4ms  
     http_reqs......................: 8757   435.445189/s
     iteration_duration.............: avg=114.47ms min=100.22ms med=111.94ms max=220.47ms p(90)=128.9ms p(95)=135.14ms
     iterations.....................: 8757   435.445189/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50